<template>
  <div id="rule">
    <h1>活动时间</h1>
    <p>报名时间：2019年10月1日至10月20日</p>
    <p>比赛作品上传时间：2019年10月15日至10月20日</p>
    <p>获奖公布时间： 2019年10月21日至2019年10月31日</p>
    <h1>活动对象</h1>
    <p>兰迪全平台在读小学员</p>
    <h1>活动组别</h1>
    <p>PreE级别/E1及E2级别/E3及以上级别</p>
    <h1>活动规则</h1>
    <p>1.比赛作品上传时间：10月15日00:00-10月20日23:59（10月21日00:00起，报名入口将被关闭）；</p>
    <p>2.在10月14日23:59之前报名的参与者，自上传第一条视频起，72小时内可以按照原步骤重新上传，新视频一旦确认提交，原视频将会被自动覆盖，评委评审的依据是72小时内上传的最后一条视频；</p>
    <p>3.在视频作品上传时间内，参与者可通过此活动链接报名。在孩子所在级别的参赛题目中任选一题，根据题目录制并上传英文视频作品（如发现上传的视频作品不符合活动规则和视频作品要求，主办方有权在不事先通知的前提下，下架作品）；</p>
    <p>5.上传视频成功后，主办方默认参与者同意将上传的视频作品出现在活动链接的视频展示区，主办方有权在不事先通知的前提下，将作品展示在活动链接中。视频展示区分为活动链接首页展示区和视频详情页展示区，首页展示区可查看三个组别的精彩视频，视频详情页可查看战区视频、最热视频、最新视频。</p>
    <h1>视频作品要求</h1>
    <p>1.孩子需全程使用英文，视频内容为原创，视频主题应选择孩子年龄所在组别的任意一题，否则作品将被视为无效并下架；</p>
    <p>2.孩子可参考题目样片中的形式，自主创作与题目相关的内容;</p>
    <p>3.建议横屏录制，录制时长最低10秒，最长不超过90秒，视频大小不超过300M；上传失败可按照教程重新上传，或者将视频发送至组委会邮箱 bisai@rochi.com</p>
    <p>4.视频中不可出现穿着裸露，男扮女装等被定义为色情低俗的行为，否则作品将被视为无效并下架；</p>
    <p>5.视频中不可出现枪支，邪教，穿军装，散布谣言等被定义为违法的行为，否则作品将被视为无效并下架；</p>
    <p>6.视频中不可出现喝酒，吸烟等被定义为令人不适的行为，否则作品将被视为无效并下架；</p>
    <p>7.视频中不可出现第三方商标、标志，或其他可识别的标记，否则作品将由主办方自主决定下架，或者模糊化处理第三方信息。</p>
    <h1>奖项设置</h1>
    <p>1.规则和奖项：</p>
    <p>由专业评审团根据决赛规则在PreE级别、E1级别、E2及以上级别组中，分别选出冠军1人、季军1人、亚军1人、最佳风采奖7人。</p>
    <p>冠军：XX</p>
    <p>亚军：XX</p>
    <p>季军：XX</p>
    <p>最佳风采奖：XX</p>
    <p>2.点赞活动规则和奖项：</p>
    <p>1）获奖方式一：推荐人成功报名比赛后转发活动链接，被推荐人通过推荐人转发的链接成功报名，则推荐人可获得奖学金100元，若多位好友报名，推荐人可获得奖学金上限为300元；若被推荐人再次转发个人已报名的活动链接给其他用户，其他用户成功报名，则被推荐人可获得奖学金100元，上限300元，但不计算到首位推荐人的名下；</p>
    <p>2）获奖方式二：活动链接的视频展示页，点赞排名前50名的用户，每人可获得奖学金100元；</p>
    <p>3）满足以上两种奖学金领取方式中的任一方式，均可获得奖学金。同时满足两种方式，奖学金不累计；</p>
    <p>4）每个用户重新上传视频后将自动覆盖原作品，原作品的点赞数将清零，不累计至新作品；</p>
    <p>5）活动期间，每人每天仅能对同一个作品点赞一次（同一微信号、手机号均视为同一人），但可以给多个作品点赞，也可以给自己点赞；</p>
    <p>6）作品的点赞数，不计入评审团评分。</p>
    <h1>活动声明</h1>
    <p>1.如果发现有参与者使用任何不正当手段参加活动，包括但不限于以下情况，主办方有权在不事先通知的前提下取消其活动参与资格、晋级资格和获奖资格：</p>
    <p>1）任何有违本活动目的和宗旨（如发布营销信息行为，一人重复使用多个账号参与活动）；</p>
    <p>2）不遵守本活动规则参与活动；</p>
    <p>3）影响活动正常有序进行等；</p>
    <p>2.活动主办方会严格监控活动后台，若发现参与者参与活动不合法（比如提交可能侵犯他人合法权益的作品），主办方有权在不事先通知的前提下取消其活动参与资格、晋级资格和获奖资格；</p>
    <p>3.对因不可抗力或政府行为导致本活动提前终止，主办方免予承担责任；主办方的前述处理措施所依据的数据及信息（包括但不限于账号操作记录、上传内容等），均以活动后台记录为准；</p>
    <h1></h1>
    <p>主办方杭州旦悦科技有限公司，兰迪少儿英语对本活动享有最终解释权</p>
    <div class="back" @click="goBack">返回</div>
  </div>
</template>

<script>
export default {
  name: 'Rule',
  head() {
    return {
      title: '活动规则'
    }
  },
  methods: {
    goBack() {
      this.$router.go(-1)
    }
  }
}
</script>

<style lang="scss" scoped>
@import '~/assets/presentation/css/main.scss';

#rule {
  padding: 3vw 5vw;
}

.back {
  position: fixed;
  top: 5vw;
  right: 0;
  padding: 3vw 4vw;
  font-size: 3.5vw;
  font-weight: bold;
  color: #fff;
  background: $p-color-0;
  box-shadow: 0 0 3vw -2vw black;
  border-top-left-radius: 30%;
  border-bottom-left-radius: 30%;
}
</style>